------------------------------------------------------------------------------------------------------------------------
      name:  <unnamed>
       log:  /Users/Boo Boo/Downloads/Helper/Analysis/analysis.log
  log type:  text
 opened on:   1 Mar 2020, 20:01:45

. 
. label variable infecon "Use of Informal Economy"

. label variable gender "Gender"

. label variable marr "Marital Status"

. label variable children "Number of children"

. label variable inc_level "Income Level"

. label variable sub_overc "Perception that rice is higher than should be"

. label variable bargain_freq "Frequency of bargaining when purchasing"

. 
. codebook, compact

Variable      Obs Unique      Mean  Min  Max  Label
------------------------------------------------------------------------------------------------------------------------
infecon       279      2  .8243728    0    1  Use of Informal Economy
gender        279      2  .6594982    0    1  Gender
marr          279      2  .4408602    0    1  Marital Status
children      279      3  .5698925    0    2  Number of children
inc_level     279      9  3.587814    1   10  Income Level
sub_overc     279      2  .7132616    0    1  Perception that rice is higher than should be
bargain_freq  279      5  3.150538    1    5  Frequency of bargaining when purchasing
------------------------------------------------------------------------------------------------------------------------

. 
. reg infecon gender, r //(1)

Linear regression                               Number of obs     =        279
                                                F(1, 277)         =       0.05
                                                Prob > F          =     0.8196
                                                R-squared         =     0.0002
                                                Root MSE          =     .38184

------------------------------------------------------------------------------
             |               Robust
     infecon |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
      gender |  -.0109268   .0478601    -0.23   0.820    -.1051425     .083289
       _cons |   .8315789   .0385346    21.58   0.000     .7557212    .9074367
------------------------------------------------------------------------------

. outreg2 using Analysis/bargain.xls, replace
Analysis/bargain.xls
dir : seeout

. 
. reg infecon gender marr, r //(2)

Linear regression                               Number of obs     =        279
                                                F(2, 276)         =       4.06
                                                Prob > F          =     0.0183
                                                R-squared         =     0.0270
                                                Root MSE          =     .37737

------------------------------------------------------------------------------
             |               Robust
     infecon |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
      gender |  -.0146955   .0476796    -0.31   0.758    -.1085574    .0791664
        marr |   .1254803     .04403     2.85   0.005     .0388031    .2121575
       _cons |   .7787452   .0444709    17.51   0.000     .6911999    .8662904
------------------------------------------------------------------------------

. outreg2 using Analysis/bargain.xls, append
Analysis/bargain.xls
dir : seeout

. 
. reg infecon gender marr children, r //(3)

Linear regression                               Number of obs     =        279
                                                F(3, 275)         =       4.02
                                                Prob > F          =     0.0080
                                                R-squared         =     0.0310
                                                Root MSE          =     .37726

------------------------------------------------------------------------------
             |               Robust
     infecon |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
      gender |  -.0178524   .0474727    -0.38   0.707    -.1113085    .0756037
        marr |   .0389508    .070877     0.55   0.583    -.1005796    .1784812
    children |   .0701615   .0416301     1.69   0.093    -.0117927    .1521156
       _cons |   .7789901   .0443831    17.55   0.000     .6916163    .8663639
------------------------------------------------------------------------------

. outreg2 using Analysis/bargain.xls, append
Analysis/bargain.xls
dir : seeout

. 
. reg infecon gender marr children sub_overc, r //(4)

Linear regression                               Number of obs     =        279
                                                F(4, 274)         =       3.67
                                                Prob > F          =     0.0063
                                                R-squared         =     0.0370
                                                Root MSE          =     .37679

------------------------------------------------------------------------------
             |               Robust
     infecon |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
      gender |  -.0203866   .0476168    -0.43   0.669    -.1141279    .0733547
        marr |   .0311462   .0710972     0.44   0.662      -.10882    .1711124
    children |   .0685823   .0409856     1.67   0.095    -.0121044     .149269
   sub_overc |   .0657914    .056476     1.16   0.245    -.0453906    .1769735
       _cons |   .7380755    .056415    13.08   0.000     .6270136    .8491374
------------------------------------------------------------------------------

. outreg2 using Analysis/bargain.xls, append
Analysis/bargain.xls
dir : seeout

. 
. reg infecon gender marr children sub_overc bargain_freq, r //(5)

Linear regression                               Number of obs     =        279
                                                F(5, 273)         =       3.59
                                                Prob > F          =     0.0037
                                                R-squared         =     0.0402
                                                Root MSE          =     .37686

------------------------------------------------------------------------------
             |               Robust
     infecon |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
      gender |   -.028893   .0460967    -0.63   0.531    -.1196432    .0618572
        marr |   .0255512   .0709165     0.36   0.719    -.1140615    .1651639
    children |    .061007   .0423175     1.44   0.151    -.0223031    .1443172
   sub_overc |   .0529061   .0591358     0.89   0.372     -.063514    .1693263
bargain_freq |   .0191316   .0206799     0.93   0.356    -.0215808    .0598439
       _cons |   .6993851   .0730307     9.58   0.000     .5556102    .8431601
------------------------------------------------------------------------------

. outreg2 using Analysis/bargain.xls, append
Analysis/bargain.xls
dir : seeout

. 
. reg infecon gender marr children sub_overc bargain_freq inc_level, r //(6)

Linear regression                               Number of obs     =        279
                                                F(6, 272)         =       4.24
                                                Prob > F          =     0.0004
                                                R-squared         =     0.0565
                                                Root MSE          =     .37433

------------------------------------------------------------------------------
             |               Robust
     infecon |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
      gender |  -.0095257   .0471864    -0.20   0.840    -.1024227    .0833713
        marr |  -.0346499   .0691872    -0.50   0.617    -.1708604    .1015605
    children |   .0432757   .0433893     1.00   0.319    -.0421458    .1286973
   sub_overc |   .0533131    .058897     0.91   0.366    -.0626388    .1692649
bargain_freq |   .0178481   .0204608     0.87   0.384    -.0224336    .0581299
   inc_level |   .0301221   .0114309     2.64   0.009     .0076179    .0526264
       _cons |   .6189382   .0845336     7.32   0.000      .452515    .7853615
------------------------------------------------------------------------------

. outreg2 using Analysis/bargain.xls, append
Analysis/bargain.xls
dir : seeout

. 
. save Data/analysis.dta, replace
file Data/analysis.dta saved

. 
. log close
      name:  <unnamed>
       log:  /Users/Boo Boo/Downloads/Helper/Analysis/analysis.log
  log type:  text
 closed on:   1 Mar 2020, 20:01:46
------------------------------------------------------------------------------------------------------------------------
